# Лещинский ИУ7-12

# Вычислить таблицу значений функции. Построить график.
# Определить максимальное значение функции и значение аргумента
# при котором оно достигается.

y0 = float(input('Введите начальное значение аргумента: ' ))
# y0 = 1.4

y1 = float(input('Введите конечное значение аргумента: '))
# y1 = 2.2

sh = float(input('Введите шаг изменения аргумента: '))
# sh = 0.025

print()

n = 1 # счетчик для таблицы
m = 0 # максимальное значение аргумента
maxd = mind = y0**5 - 7.9 * y0**4 + 24.46 * y0**3 - 37.074 * y0**2 + 27.512 * y0 - 8.0042
graph = 78 - 9

print('         y          g')
print('-------------------------')
yt = y0
while y0 < y1+0.9*sh:

    d = y0**5 - 7.9 * y0**4 + 24.46 * y0**3 - 37.074 * y0**2 + 27.512 * y0 - 8.0042
    print('{:3d} {:8.3f} {:12.7f}'.format(n, y0, d))

    if d > maxd:
        maxd = d
        m = y0

    if d < mind:
        mind = d
        
    n = n + 1
    y0 = y0 + sh

print()
print('Максимальное значение функции: ''{:.7f}'.format(maxd))
print('Максимальное значение функции достигается при y = ''{:.3f}'.format(m))

print()
print('График функции d = y0**5 - 7.9 * y0**4 + 24.46 * y0**3 - 37.074 * y0**2 + 27.512 * y0 - 8.0042 ')    
print()

#Построение оси и вывод минимального и максимального значений функции:
print(' '*9,'{:<10.5g} '.format(mind),' '*49,'{:>10.5g}'.format(maxd),sep='')
print(' '*9,'-'*graph,'>',sep='')

#Построение графика:
j = round((0 - mind)/(maxd - mind)*graph)
y0 = yt
y1 = int((y1-yt+1.9*sh)//sh)

for yt in range(y1):
    y = yt*sh+y0
    #Вывод значений переменной:
    if True:# (y - y0)%2 == 1:
        print('{:>7.5g}  '.format(y),end='')
    else:
        print(' '*9,end='')
    #Вывод графика:
    for i in range(graph+1):
        d = y**5 - 7.9 * y**4 + 24.46 * y**3 - 37.074 * y**2\
+ 27.512 * y - 8.0042
        d = int(round((d - mind)/(maxd - mind)*graph))
        if d == i:
            print('*',end='')
        elif i == j:
            print('|',end='')
        else:
            print(' ',end='')
    print()





    





